const {readEnv} = require('../lib/database')
const {cmd , commands} = require('../command')

cmd({
    pattern: "menu",
    desc: "get cmd list",
    category: "main",
    filename: __filename
},
async(conn, mek, m,{from, quoted, body, isCmd, command, args, q, isGroup, sender, senderNumber, botNumber2, botNumber, pushname, isMe, isOwner, groupMetadata, groupName, participants, groupAdmins, isBotAdmins, isAdmins, reply}) => {
try{
const config = await readEnv();
let menu = {
main: '',
download: '',
group: '',
owner: '',
convert: '',
search: ''
};

for (let i = 0; i < commands.length; i++) {
if (commands[i].pattern && !commands[i].dontAddCommandList) {
menu[commands[i].category] += `{config.PREFIX}${commands[i].pattern}\n`;
 }
}

let madeMenu = ` 
    ╭════ DILISHA ════─❃
┃▢╭─────────────┈
┃▢│ Prefix : ${menu.prefix}
┃▢│ download : ${menu.download}
┃▢│ Bot : KING_DILISHA-MD
┃▢│ Owner : ${menu.pushname}
┃▢│ Date : ${menu.date}
┃▢│ Time : ${menu.time}
┃▢│ Plugins : ${menu.plugins}
┃▢│ Version : {menu.v2.0}
┃▢│ Ram : ${menu.ram}
┃▢│ Uptime : ${menu.uptime}
┃▢│ group : ${menu.group}  
┃▢│ search : ${menu.search}
┃▢│ convert : ${menu.convert}
┃▢╰─────────────┈
╰══════════════════─❃```



╰⭑➤➤⭑➤➤⭑➤ ʙᴜɢ ᴀɴᴅʀᴏɪᴅ
> 𝐱𝐩𝐚𝐲𝐦𝐞𝐧𝐭 ◁️🕷️
> 𝐨𝐧𝐞𝐤𝐢𝐥𝐥◁️❄️🕷️
> 𝐱𝐟𝐫𝐞𝐞𝐳𝐞 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ʙᴜɢ ᴡᴇʙ
> 𝐱𝐟𝐫𝐞𝐞𝐳𝐞 ◁️❄️🕷️
> 𝐱𝐛𝐥𝐚𝐧𝐤𝐬𝐜𝐫𝐧 ◁️❄️🕷️
> 𝐱𝐰𝐞𝐛𝐠𝐜 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ʙᴜɢ ɪᴏꜱ
> 𝐱𝐢𝐨𝐬 ◁️❄️🕷️
> 𝐱𝐢𝐨𝐬𝟐 ◁️❄️🕷️
> 𝐢𝐨𝐬𝐤𝐢𝐥𝐥 ◁️❄️🕷️
> 𝐱𝐢𝐨𝐬𝐟𝐫𝐞𝐞𝐳𝐞 ◁️❄️🕷️
> 𝐱𝐢𝐨𝐬𝐡𝐨𝐭 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ʙᴜɢ ᴏᴛʜᴇʀ
> 𝐭𝐞𝐦𝐩𝐛𝐚𝐧 ◁️❄️🕷️
> 𝐥𝐨𝐜𝐤𝐨𝐭𝐩 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ʙᴜɢ ɢʀᴏᴜᴘ ᴄʜᴀᴛ
> 𝐱𝐰𝐞𝐛𝐠𝐜 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ᴏᴡɴᴇʀ ᴍᴇɴᴜ
> 𝐠𝐞𝐭𝐬𝐞𝐬𝐬𝐢𝐨𝐧 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐞𝐭𝐞𝐬𝐞𝐬𝐬𝐢𝐨𝐧 ◁️❄️🕷️
> 𝐣𝐨𝐢𝐧 ◁️❄️🕷️
> 𝐬𝐡𝐮𝐭𝐝𝐨𝐰𝐧 ◁️❄️🕷️
> 𝐫𝐞𝐬𝐭𝐚𝐫𝐭 ◁️❄️🕷️
> 𝐚𝐮𝐭𝐨𝐫𝐞𝐚𝐝 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐚𝐮𝐭𝐨𝐭𝐲𝐩𝐢𝐧𝐠 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐚𝐮𝐭𝐨𝐫𝐞𝐜𝐨𝐫𝐝𝐢𝐧𝐠 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐚𝐮𝐭𝐨𝐫𝐞𝐜𝐨𝐫𝐝𝐭𝐲𝐩 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐚𝐮𝐭𝐨𝐛𝐢𝐨 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐚𝐮𝐭𝐨𝐬𝐰𝐯𝐢𝐞𝐰 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐦𝐨𝐝𝐞 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐛𝐥𝐨𝐜𝐤 ◁️❄️🕷️
> 𝐮𝐧𝐛𝐥𝐨𝐜𝐤 ◁️❄️🕷️
> 𝐛𝐚𝐜𝐤𝐮𝐩 ◁️❄️🕷️
> 𝐠𝐞𝐭𝐜𝐚𝐬𝐞 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐨𝐰𝐧𝐞𝐫 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐨𝐰𝐧𝐞𝐫 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ɢʀᴏᴜᴘ ᴍᴇɴᴜ
> 𝐜𝐥𝐨𝐬𝐞𝐭𝐢𝐦𝐞 ◁️❄️🕷️
> 𝐨𝐩𝐞𝐧𝐭𝐢𝐦𝐞 ◁️❄️🕷️
> 𝐤𝐢𝐜𝐤 ◁️❄️🕷️
> 𝐚𝐝𝐝 ◁️❄️🕷️
> 𝐩𝐫𝐨𝐦𝐨𝐭𝐞 ◁️❄️🕷️
> 𝐝𝐞𝐦𝐨𝐭𝐞 ◁️❄️🕷️
> 𝐬𝐞𝐭𝐝𝐞𝐬𝐜 ◁️❄️🕷️
> 𝐬𝐞𝐭𝐩𝐩𝐠𝐜 ◁️❄️🕷️
> 𝐭𝐚𝐠𝐚𝐥𝐥 ◁️❄️🕷️
> 𝐡𝐢𝐝𝐞𝐭𝐚𝐠 ◁️❄️🕷️
> 𝐭𝐨𝐭𝐚𝐠 ◁️❄️🕷️
> 𝐠𝐫𝐨𝐮𝐩 *[𝐨𝐩𝐭𝐢𝐨𝐧]* ◁️❄️🕷️
> 𝐞𝐝𝐢𝐭𝐢𝐧𝐟𝐨 ◁️❄️🕷️
> 𝐥𝐢𝐧𝐤𝐠𝐜 ◁️❄️🕷️
> 𝐫𝐞𝐯𝐨𝐤𝐞 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐨𝐧𝐥𝐢𝐧𝐞 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ᴍᴀɪɴ ᴍᴇɴᴜ
> 𝐦𝐞𝐧𝐮 ◁️❄️🕷️
> 𝐛𝐮𝐲𝐩𝐫𝐞𝐦𝐢𝐮𝐦 ◁️❄️🕷️
> 𝐫𝐮𝐧𝐭𝐢𝐦𝐞 ◁️❄️🕷️
> 𝐬𝐜𝐫𝐢𝐩𝐭 ◁️❄️🕷️
> 𝐝𝐨𝐧𝐚𝐭𝐞 ◁️❄️🕷️
> 𝐨𝐰𝐧𝐞𝐫 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ᴄᴏɴᴠᴇʀᴛ ᴍᴇɴᴜ
> 𝐬𝐭𝐢𝐜𝐤𝐞𝐫 ◁️❄️🕷️
> 𝐬𝐦𝐞𝐦𝐞 ◁️❄️🕷️
> 𝐭𝐚𝐤𝐞 ◁️❄️🕷️
> 𝐭𝐨𝐢𝐦𝐚𝐠𝐞 ◁️❄️🕷️
> 𝐭𝐨𝐯𝐢𝐝𝐞𝐨 ◁️❄️🕷️
> 𝐭𝐨𝐚𝐮𝐝𝐢𝐨 ◁️❄️🕷️
> 𝐭𝐨𝐦𝐩𝟑 ◁️❄️🕷️
> 𝐭𝐨𝐯𝐧 ◁️❄️🕷️
> 𝐭𝐨𝐠𝐢𝐟 ◁️❄️🕷️
> 𝐭𝐨𝐪𝐫 ◁️❄️🕷️
> 𝐭𝐨𝐯𝐢𝐞𝐰𝐨𝐧𝐜𝐞 ◁️❄️🕷️
> 𝐟𝐥𝐢𝐩𝐭𝐞𝐱𝐭 ◁️❄️🕷️
> 𝐞𝐦𝐨𝐣𝐢𝐦𝐢𝐱 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ᴅᴀᴛᴀʙᴀsᴇ ᴍᴇɴᴜ
> 𝐚𝐝𝐝𝐯𝐢𝐝𝐞𝐨 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐢𝐦𝐚𝐠𝐞 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐬𝐭𝐢𝐜𝐤𝐞𝐫 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐯𝐧 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐳𝐢𝐩 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐚𝐩𝐤 ◁️❄️🕷️
> 𝐚𝐝𝐝𝐩𝐝𝐟 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐯𝐢𝐝𝐞𝐨 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐢𝐦𝐚𝐠𝐞 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐬𝐭𝐢𝐜𝐤𝐞𝐫 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐯𝐧 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐳𝐢𝐩 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐚𝐩𝐤 ◁️❄️🕷️
> 𝐝𝐞𝐥𝐩𝐝𝐟 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐯𝐢𝐝𝐞𝐨 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐢𝐦𝐚𝐠𝐞 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐬𝐭𝐢𝐜𝐤𝐞𝐫 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐯𝐧 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐳𝐢𝐩 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐚𝐩𝐤 ◁️❄️🕷️
> 𝐥𝐢𝐬𝐭𝐩𝐝𝐟 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ ᴅᴏᴡɴ ᴍᴇɴᴜ
> 𝐩𝐥𝐚𝐲 ◁️❄️🕷️
> 𝐲𝐭𝐩𝐦𝟑 ◁️❄️🕷️
> 𝐲𝐭𝐦𝐩𝟒 ◁️❄️🕷️
> 𝐬𝐨𝐮𝐧𝐝𝟏 - 𝐬𝐨𝐮𝐧𝐝𝟏𝟔𝟏 ◁️❄️🕷️

╰⭑➤➤⭑➤➤⭑➤ 𝚃𝙰𝙶 𝙼𝙴𝙽𝚄
> 𝙱𝚁𝙰𝚉𝚉 ◁️❄️🕷️
> 𝙼𝙾𝚅𝙸𝙴 ◁️❄️🕷️
> 𝚃𝚅 𝚂𝙴𝚁𝙸𝙴𝚂 ◁️❄️🕷️

 ╰⭑➤➤⭑➤➤⭑➤ 𝔹𝔸ℕ𝔻 ⭕
> 𝙱𝙰𝙽𝙳 𝙽𝙱 (+94**)
> 𝚁𝙴𝙿𝙾𝚃 𝙽𝙱 (+94**)
> 𝚂𝙿𝙰𝙼 𝙽𝙱 (+94**)

︻╦̵̵͇̿̿̿̿╤──.....🏆⭕🏆╾━╤デ╦︻

©𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐛𝐲 𝐑𝐎𝐘𝐄𝐋-𝐌𝐃𝐕𝟐
        
ʕ ͡° ʖ̯ ͡︻╦̵̵͇̿̿̿̿╤──𝚃𝙷𝙰𝙽𝙺𝚂 𝚄𝚂𝙸𝙽𝙶 𝙱𝙾𝚃✧⎠⎠╾━╤デ╦︻
    
`
await conn.sendMessage(from,{image:{url:config.ALIVE_IMG},caption:madeMenu},{quoted:mek})
    
}catch(e){
console.log(e)
reply(`${e}`)
}
})
